souri_name = [
    "伊藤博文",
    "黒田清隆",
    "山縣有朋",
    "松方正義",
    "大隈重信",
    "山本権兵衛",
    "寺内正毅",
    "原敬",
    "高橋是清",
    "加藤友三郎",
    "清浦奎吾",
    "加藤高明",
    "若槻礼次郎",
    "田中義一",
    "濱口雄幸",
    "犬養毅",
    "斎藤実",
    "岡田啓介",
    "広田弘毅",
    "林銑十郎",
    "近衛文麿",
    "平沼騏一郎",
    "阿部信行",
    "米内光政",
    "東條英機",
    "小磯国昭",
    "鈴木貫太郎",
    "東久邇宮稔彦",
    "幣原喜重郎",
    "吉田茂",
    "片山哲",
    "芦田均",
    "鳩山一郎",
    "石橋湛山",
    "岸信介",
    "池田勇人",
    "佐藤栄作",
    "田中角栄",
    "三木武夫",
    "福田赳夫",
    "大平正芳",
    "鈴木善幸",
    "中曽根康弘",
    "竹下登",
    "宇野宗佑",
    "海部俊樹",
    "宮澤喜一",
    "細川護煕",
    "羽田孜",
    "村山富市",
    "橋本龍太郎",
    "小渕恵三",
    "森喜朗",
    "小泉純一郎",
    "安倍晋三",
    "福田康夫",
    "麻生太郎",
    "鳩山由紀夫",
    "菅直人",
    "野田佳彦",
    "菅義偉",
    "岸田文雄",
    "石破茂",
    "高市早苗"
]

souri = [
    [1, "伊藤博文", "1885年12月22日", "1888年4月30日"],
    [2, "黒田清隆", "1888年4月30日", "1889年10月25日"],
    [3, "山縣有朋", "1889年12月24日", "1891年5月6日"],
    [4, "松方正義", "1891年5月6日", "1892年8月8日"],
    [5, "伊藤博文", "1892年8月8日", "1896年8月31日"],
    [6, "松方正義", "1896年9月18日", "1898年1月12日"],
    [7, "伊藤博文", "1898年1月12日", "1898年6月30日"],
    [8, "大隈重信", "1898年6月30日", "1898年11月8日"],
    [9, "山縣有朋", "1898年11月8日", "1900年10月19日"],
    [10, "伊藤博文", "1900年10月19日", "1901年5月10日"],
    [11, "桂太郎", "1901年6月2日", "1906年1月7日"],
    [12, "西園寺公望", "1906年1月7日", "1908年7月14日"],
    [13, "桂太郎", "1908年7月14日", "1911年8月30日"],
    [14, "西園寺公望", "1911年8月30日", "1912年12月21日"],
    [15, "桂太郎", "1912年12月21日", "1913年2月20日"],
    [16, "山本權兵衛", "1913年2月20日", "1914年4月16日"],
    [17, "大隈重信", "1914年4月16日", "1916年10月9日"],
    [18, "寺内正毅", "1916年10月9日", "1918年9月29日"],
    [19, "原敬", "1918年9月29日", "1921年11月13日"],
    [20, "高橋是清", "1921年11月13日", "1922年6月12日"],
    [21, "加藤友三郎", "1922年6月12日", "1923年8月24日"],
    [22, "山本権兵衛", "1923年9月2日", "1924年1月7日"],
    [23, "清浦奎吾", "1924年1月7日", "1924年6月11日"],
    [24, "加藤高明", "1924年6月11日", "1926年1月28日"],
    [25, "若槻礼次郎", "1926年1月30日", "1927年4月20日"],
    [26, "田中義一", "1927年4月20日", "1929年7月2日"],
    [27, "濱口雄幸", "1929年7月2日", "1931年4月14日"],
    [28, "若槻礼次郎", "1931年4月14日", "1931年12月13日"],
    [29, "犬養毅", "1931年12月13日", "1932年5月16日"],
    [30, "斎藤実", "1932年5月26日", "1934年7月8日"],
    [31, "岡田啓介", "1934年7月8日", "1936年3月9日"],
    [32, "広田弘毅", "1936年3月9日", "1937年2月2日"],
    [33, "林銑十郎", "1937年2月2日", "1937年6月4日"],
    [34, "近衛文麿", "1937年6月4日", "1939年1月5日"],
    [35, "平沼騏一郎", "1939年1月5日", "1939年8月30日"],
    [36, "阿部信行", "1939年8月30日", "1940年1月16日"],
    [37, "米内光政", "1940年1月16日", "1940年7月22日"],
    [38, "近衛文麿", "1940年7月22日", "1941年7月18日"],
    [39, "近衛文麿", "1940年7月18日", "1941年10月18日"],
    [40, "東條英機", "1941年10月18日", "1944年7月22日"],
    [41, "小磯国昭", "1944年7月22日", "1945年4月7日"],
    [42, "鈴木貫太郎", "1945年4月7日", "1945年8月17日"],
    [43, "東久邇宮稔彦", "1945年8月17日", "1945年10月9日"],
    [44, "幣原喜重郎", "1945年10月9日", "1946年5月22日"],
    [45, "吉田茂", "1946年5月22日", "1947年5月24日"],
    [46, "片山哲", "1947年5月24日", "1948年3月10日"],
    [47, "芦田均", "1948年3月10日", "1948年10月15日"],
    [48, "吉田茂", "1948年10月15日", "1949年2月16日"],
    [49, "吉田茂", "1949年2月16日", "1952年10月30日"],
    [50, "吉田茂", "1952年10月30日", "1953年5月21日"],
    [51, "吉田茂", "1953年5月21日", "1954年12月10日"],
    [52, "鳩山一郎", "1954年12月10日", "1955年3月19日"],
    [53, "鳩山一郎", "1955年3月19日", "1955年11月22日"],
    [54, "鳩山一郎", "1955年11月22日", "1956年12月23日"],
    [55, "石橋湛山", "1956年12月23日", "1957年2月25日"],
    [56, "岸信介", "1957年2月25日", "1958年6月12日"],
    [57, "岸信介", "1958年6月12日", "1960年7月19日"],
    [58, "池田勇人", "1960年7月19日", "1960年12月8日"],
    [59, "池田勇人", "1960年12月8日", "1963年12月9日"],
    [60, "池田勇人", "1963年12月9日", "1964年11月9日"],
    [61, "佐藤栄作", "1964年11月9日", "1967年2月17日"],
    [62, "佐藤栄作", "1967年2月17日", "1970年1月14日"],
    [63, "佐藤栄作", "1970年1月14日", "1972年7月7日"],
    [64, "田中角栄", "1972年7月7日", "1972年12月22日"],
    [65, "田中角栄", "1972年12月22日", "1974年12月9日"],
    [66, "三木武夫", "1974年12月9日", "1976年12月24日"],
    [67, "福田赳夫", "1976年12月24日", "1978年12月7日"],
    [68, "大平正芳", "1978年12月7日", "1979年11月9日"],
    [69, "大平正芳", "1979年11月9日", "1980年6月12日"],
    [70, "鈴木善幸", "1980年7月17日", "1982年11月27日"],
    [71, "中曽根康弘", "1982年11月27日", "1983年12月27日"],
    [72, "中曽根康弘", "1983年12月27日", "1986年7月22日"],
    [73, "中曽根康弘", "1986年7月22日", "1987年11月6日"],
    [74, "竹下登", "1987年11月6日", "1989年6月3日"],
    [75, "宇野宗佑", "1989年6月3日", "1989年8月10日"],
    [76, "海部俊樹", "1989年8月10日", "1990年2月28日"],
    [77, "海部俊樹", "1990年2月28日", "1991年11月5日"],
    [78, "宮澤喜一", "1991年11月5日", "1993年8月9日"],
    [79, "細川護煕", "1993年8月9日", "1994年4月28日"],
    [80, "羽田孜", "1994年4月28日", "1994年6月30日"],
    [81, "村山富市", "1994年6月30日", "1996年1月11日"],
    [82, "橋本龍太郎", "1996年1月11日", "1996年11月7日"],
    [83, "橋本龍太郎", "1996年11月7日", "1998年7月30日"],
    [84, "小渕恵三", "1998年7月30日", "2000年4月5日"],
    [85, "森喜朗", "2000年4月5日", "2000年7月4日"],
    [86, "森喜朗", "2000年7月4日", "2001年4月26日"],
    [87, "小泉純一郎", "2001年4月26日", "2003年11月19日"],
    [88, "小泉純一郎", "2003年11月19日", "2005年9月21日"],
    [89, "小泉純一郎", "2005年9月21日", "2006年9月26日"],
    [90, "安倍晋三", "2006年9月26日", "2007年9月26日"],
    [91, "福田康夫", "2007年9月26日", "2008年9月24日"],
    [92, "麻生太郎", "2008年9月24日", "2009年9月16日"],
    [93, "鳩山由紀夫", "2009年9月16日", "2010年6月8日"],
    [94, "菅直人", "2010年6月8日", "2011年9月2日"],
    [95, "野田佳彦", "2011年9月2日", "2012年12月26日"],
    [96, "安倍晋三", "2012年12月26日", "2014年12月24日"],
    [97, "安倍晋三", "2014年12月24日", "2017年11月1日"],
    [98, "安倍晋三", "2017年11月1日", "2020年9月16日"],
    [99, "菅義偉", "2020年9月16日", "2021年10月4日"],
    [100, "岸田文雄", "2021年10月4日", "2021年11月10日"],
    [101, "岸田文雄", "2021年11月10日", "2024年10月1日"],
    [102, "石破茂", "2024年10月1日", "2024年11月11日"],
    [103, "石破茂", "2024年11月11日", "2025年10月21日"],
    [104, "高市早苗", "2025年10月21日", "（現職）"],
]

window.onload = start_game;

const score_text = document.getElementById("score")
const era_text = document.getElementById("era")
const pre_generation_text = document.getElementById("pre_generation")
const pre_president_text = document.getElementById("pre_president")
const generation_text = document.getElementById("generation")
const president_answer = document.getElementById("president")
const pro_generation_text = document.getElementById("pro_generation")
const pro_president_text = document.getElementById("pro_president")
const before_result_area = document.getElementById("before_result")
const answer_button = document.getElementById("answer")
const after_result_area = document.getElementById("after_result")
const result_text = document.getElementById("result")
const result_text_text = document.getElementById("result_text")
const one_more_button = document.getElementById("one_more")

let answer_president = "";
let correct = 0;
let count = 0;
let combo = 0;

answer_button.addEventListener("click",answer);
one_more_button.addEventListener("click",start_game);

function start_game(){
    president_answer.value = "";
    before_result_area.style.display = "block";
    after_result_area.style.display = "none";
    choice = parseInt(((Math.random() * 10000) % (souri.length - 2) + 1).toFixed(0));
    souri_list = [souri[choice],souri[choice + 1],souri[choice + 2]];
    start_year = souri_list[0][2];
    end_year = souri_list[2][3];
    era_text.innerHTML = start_year + "〜" + end_year;
    pre_generation_text.innerHTML = "第" + souri_list[0][0] + "代";
    generation_text.innerHTML = "第" + souri_list[1][0] + "代";
    pro_generation_text.innerHTML = "第" + souri_list[2][0] + "代";
    pre_president_text.innerHTML = souri_list[0][1];
    answer_president = souri_list[1][1];
    pro_president_text.innerHTML = souri_list[2][1];
}

function answer(){
    if(president_answer.value === ""){
        window.alert("回答を入力してください。");
    } else {
        before_result_area.style.display = "none";
        after_result_area.style.display = "block";
        if(president_answer.value == answer_president){
            count += 1;
            correct += 1;
            combo += 1;
            result_text.innerHTML = "正解";
        } else {
            count += 1;
            combo = 0;
            result_text.innerHTML = "不正解";
        }
        score_text.innerHTML = count + "問中" + correct + "問正解(" + (correct / count * 100).toFixed(0) + "％)";
        if(combo < 4){
            score_text.style.color = "#000000";
        } else if(combo < 9){
            score_text.style.color = "#0000ff";
        } else if(combo < 14){
            score_text.style.color = "#00ff00";
        } else {
            score_text.style.color = "#ff0000";
        }
        result_text_text.innerHTML = souri_list[1][0] + "代目総理大臣は...<br><span class=bold>" + souri_list[1][1] + "</span>です。"
    }
}